import rat from "@/assets/svg_chinese_n_japanese/rat.vue";
import dog from "@/assets/svg_chinese_n_japanese/dog.vue";
import ox from "@/assets/svg_chinese_n_japanese/ox.vue";
import tiger from "@/assets/svg_chinese_n_japanese/tiger.vue";
import rabbit from "@/assets/svg_chinese_n_japanese/rabbit.vue";
import dragon from "@/assets/svg_chinese_n_japanese/dragon.vue";
import snake from "@/assets/svg_chinese_n_japanese/snake.vue";
import horse from "@/assets/svg_chinese_n_japanese/horse.vue";
import sheep from "@/assets/svg_chinese_n_japanese/goat.vue";
import monkey from "@/assets/svg_chinese_n_japanese/monkey.vue";
import rooster from "@/assets/svg_chinese_n_japanese/rooster.vue";
import pig from "@/assets/svg_chinese_n_japanese/pig.vue";

export const japaneseSigns = [
    {
        ru: 'Крыса',
        en: 'rat',
        description: 'Люди, рожденные в год Крысы, обычно обладают тонким умом и быстрым интеллектом. Они умеют находить выход из сложных ситуаций и часто привлекают к себе внимание своей находчивостью. Крыса – символ ума и ловкости в японской культуре. Те, кто признаны Крысами, также известны своей способностью адаптироваться к изменяющимся обстоятельствам и преуспевать в динамичной среде. Они стремятся к новым знаниям и остаются открытыми для всего нового, что приносит жизнь.',
        image: rat,
    },
    {
        ru: 'Бык',
        en: 'ox',
        description: 'Люди, рожденные в год Быка, часто известны своей силой и выносливостью. Они способны преодолевать препятствия на своем пути и достигать поставленных целей. Бык – символ силы и стойкости в японской культуре. Те, кто рождены под знаком Быка, также отличаются своей трудолюбивостью и способностью вести дела до конца. Они обладают уверенностью в себе и готовы принимать трудные решения, несмотря на препятствия.',
        image: ox,
    },
    {
        ru: 'Тигр',
        en: 'tiger',
        description: 'Люди, рожденные в год Тигра, часто обладают страстью и решительностью. Они стремятся к достижению высоких результатов и не боятся брать на себя ответственность. Тигр – символ мужества и решительности в японской культуре. Те, кто признаны Тиграми, также известны своей независимостью и готовностью принимать вызовы смело и без страха. Они умеют вдохновлять окружающих и становиться лидерами в любых областях жизни.',
        image: tiger,
    },
    {
        ru: 'Кролик',
        en: 'rabbit',
        description: 'Люди, рожденные в год Кролика, обычно известны своей элегантностью и чувствительностью. Они способны создавать гармонию вокруг себя и наслаждаются прекрасными моментами жизни. Кролик – символ гармонии и утонченности в японской культуре. Те, кто признаны Кроликами, также обладают творческим потенциалом и умением привносить красоту в мир. Они стремятся к гармонии в отношениях и ценят красоту во всех ее проявлениях.',
        image: rabbit,
    },
    {
        ru: 'Дракон',
        en: 'dragon',
        description: 'Люди, рожденные в год Дракона, часто обладают величием и силой. Они могут быть вдохновляющими лидерами и обладать огромной энергией. Дракон – символ величия и мудрости в японской культуре. Те, кто признаны Драконами, также известны своей способностью творить и вдохновлять других. Они могут быть сторонниками перемен и обладать яркой индивидуальностью, способной привлекать внимание окружающих.',
        image: dragon,
    },
    {
        ru: 'Змея',
        en: 'snake',
        description: 'Люди, рожденные в год Змеи, обычно известны своей харизмой и проницательностью. Они способны понимать глубокие тайны и обладают интуитивным пониманием мира. Змея – символ мудрости и интуиции в японской культуре. Те, кто признаны Змеями, также обладают способностью к анализу и пониманию сложных ситуаций. Они могут быть отличными наблюдателями и имеют способность проникать в суть вопроса.',
        image: snake,
    },
    {
        ru: 'Лошадь',
        en: 'horse',
        description: 'Люди, рожденные в год Лошади, часто известны своей энергией и страстью к жизни. Они стремятся к свободе и приключениям, не боясь рисковать ради достижения своих целей. Лошадь – символ свободы и динамизма в японской культуре. Те, кто признаны Лошадьми, также обладают высокими амбициями и стремлением к самосовершенствованию. Они могут быть вдохновляющими лидерами и готовыми преодолевать любые препятствия.',
        image: horse,
    },
    {
        ru: 'Овца',
        en: 'sheep',
        description: 'Люди, рожденные в год Овцы, обычно известны своей нежностью и заботой о других. Они способны создавать атмосферу гармонии и спокойствия вокруг себя и ценят душевные ценности. Овца – символ доброты и сострадания в японской культуре. Те, кто признаны Овцами, также обладают творческим потенциалом и способностью выражать свои чувства. Они могут быть чуткими к потребностям других и готовыми прийти на помощь в трудную минуту.',
        image: sheep,
    },
    {
        ru: 'Обезьяна',
        en: 'monkey',
        description: 'Люди, рожденные в год Обезьяны, часто известны своим остроумием и жизнелюбием. Они способны приносить радость и веселье в окружающую среду и быть душой компании. Обезьяна – символ веселья и оптимизма в японской культуре. Те, кто признаны Обезьянами, также обладают творческим мышлением и способностью придумывать нестандартные решения. Они могут быть вдохновленными лидерами и привлекать внимание своей энергией.',
        image: monkey,
    },
    {
        ru: 'Петух',
        en: 'rooster',
        description: 'Люди, рожденные в год Петуха, часто известны своей целеустремленностью и решительностью. Они способны принимать трудные решения и добиваться поставленных целей с настойчивостью. Петух – символ самоуверенности и упорства в японской культуре. Те, кто признаны Петухами, также обладают острым умом и способностью критически мыслить. Они могут быть отличными организаторами и вести любые дела к успеху.',
        image: rooster,
    },
    {
        ru: 'Собака',
        en: 'dog',
        description: 'Люди, рожденные в год Собаки, обычно известны своей преданностью и добросердечностью. Они готовы всегда прийти на помощь другим и быть верными друзьями в трудную минуту. Собака – символ верности и дружбы в японской культуре. Те, кто признаны Собаками, также обладают сильным чувством справедливости и готовы защищать слабых и беззащитных. Они могут быть отличными компаньонами и надежными партнерами в любых отношениях.',
        image: dog,
    },
    {
        ru: 'Свинья',
        en: 'pig',
        description: 'Люди, рожденные в год Свиньи, обычно известны своей добротой и щедростью. Они способны наслаждаться жизнью и ценить все ее прекрасные моменты. Свинья – символ изобилия и счастья в японской культуре. Те, кто признаны Свиньями, также обладают умением привносить радость в жизнь окружающих и делать мир ярче. Они могут быть творчески одаренными и способными на большие жесты доброты и заботы.',
        image: pig,
    }
];