<script setup></script>

<template>
  <section class="footer">
    <div class="container">
      <p>
        Цвета, как язык дизайна, могут творить чудеса на экране. От пастельных
        оттенков, приносящих умиротворение, до ярких, взрывных цветов, создающих
        динамичные визуальные впечатления. Интерфейс — это путеводная звезда
        пользователя в мире технологий. Правильное сочетание цветов не только
        привлекает внимание, но и улучшает восприятие информации. Так что
        давайте играть с палитрой, создавая уникальные визуальные истории,
        которые не оставят равнодушными тех, кто взаимодействует с интерфейсом.
        Готов воплощать цветовые идеи в жизнь!"Цвета, как язык дизайна, могут
        творить чудеса на экране. От пастельных оттенков, приносящих
        умиротворение, до ярких, взрывных цветов, создающих динамичные
        визуальные впечатления. Интерфейс — это путеводная звезда пользователя в
        мире технологий. Правильное сочетание цветов не только привлекает
        внимание, но и улучшает восприятие информации. Так что давайте играть с
        палитрой, создавая уникальные визуальные истории, которые не оставят
        равнодушными тех, кто взаимодействует с интерфейсом. Готов воплощать
        цветовые идеи в жизнь!"Цвета, как язык дизайна, могут творить чудеса на
        экране. От пастельных оттенков, приносящих умиротворение, до ярких,
        взрывных цветов, создающих динамичные визуальные впечатления. Интерфейс
        — это путеводная звезда пользователя в мире технологий. Правильное
        сочетание цветов не только привлекает внимание, но и улучшает восприятие
        информации. Так что давайте играть с палитрой, создавая уникальные
        визуальные истории, которые не оставят равнодушными тех, кто
        взаимодействует с интерфейсом. Готов воплощать цветовые идеи в
        жизнь!"Цвета, как язык дизайна, могут творить чудеса на экране. От
        пастельных оттенков, приносящих умиротворение, до ярких, взрывных
        цветов, создающих динамичные визуальные впечатления. Интерфейс — это
        путеводная звезда пользователя в мире технологий. Правильное сочетание
        цветов не только привлекает внимание, но и улучшает восприятие
        информации. Так что давайте играть с палитрой, создавая уникальные
        визуальные истории, которые не оставят равнодушными тех, кто
        взаимодействует с интерфейсом. Готов воплощать цветовые идеи в жизнь!"
      </p>
      <footer>
        <router-link to="/" class="logo">
          <svg
            width="178"
            height="64"
            viewBox="0 0 178 64"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fill-rule="evenodd"
              clip-rule="evenodd"
              d="M16.5456 11.5848C16.5624 11.7642 16.6064 12.2466 16.6432 12.6567C16.865 15.1246 17.4573 18.0446 18.1872 20.2688C19.4865 24.228 21.5555 27.6367 23.8048 29.5238C25.4561 30.9092 27.0679 31.6761 28.7514 31.8772L29.1851 31.929L28.8753 31.9721C28.212 32.0643 27.0518 32.382 26.497 32.6234C22.9691 34.1586 19.9179 38.2241 18.1349 43.7653C17.4307 45.9537 16.8341 48.9315 16.6424 51.2143C16.6065 51.6415 16.5632 52.1378 16.5462 52.3172C16.5291 52.4967 16.5267 52.6435 16.5408 52.6435C16.5549 52.6435 16.6996 52.4156 16.8623 52.1371C17.7736 50.5781 19.5462 48.3442 20.7565 47.2299C22.3474 45.7651 23.9026 44.7429 25.5177 44.1003C29.1242 42.6657 32.9769 43.128 36.3713 45.4027C38.8115 47.0379 40.6847 49.1018 42.7742 52.457L42.9096 52.6745L42.8732 52.1774C42.5919 48.3402 41.7458 44.5888 40.4665 41.5073C38.2174 36.0898 34.7648 32.6637 30.9197 32.034L30.2382 31.9224L30.6409 31.877C33.395 31.5662 36.0858 29.685 38.2086 26.5859C40.357 23.4497 41.8605 19.3024 42.5598 14.583C42.7092 13.5751 42.9332 11.3262 42.8887 11.2815C42.8771 11.2699 42.6907 11.5466 42.4747 11.8963C39.6228 16.5132 35.8716 19.5421 31.9831 20.3679C30.9621 20.5847 29.2025 20.6429 28.1939 20.4932C25.3471 20.0707 22.821 18.6968 20.3547 16.2297C19.1546 15.0292 17.9313 13.4708 16.9769 11.9265C16.7498 11.5592 16.553 11.2585 16.5396 11.2585C16.5261 11.2585 16.5289 11.4053 16.5456 11.5848Z"
              fill="#FFEB61"
            />
            <path
              d="M60.1505 34.1719C60.1505 30.1036 61.4361 26.9955 64.0072 24.8475C66.5783 22.6995 69.605 21.6255 73.0874 21.6255C75.8864 21.6255 78.2948 22.2276 80.3126 23.4318V28.216C78.49 26.9142 76.3257 26.2632 73.8197 26.2632C71.509 26.2632 69.54 26.9142 67.9127 28.216C66.2854 29.4853 65.4717 31.4055 65.4717 33.9766C65.4717 36.4826 66.2691 38.4028 67.8639 39.7372C69.4911 41.039 71.4439 41.6899 73.7221 41.6899C76.1956 41.6899 78.4738 41.0878 80.5567 39.8836V44.7167C78.311 45.7907 75.7236 46.3277 72.7945 46.3277C69.3772 46.3277 66.4156 45.2862 63.9095 43.2033C61.4035 41.0878 60.1505 38.0773 60.1505 34.1719Z"
              fill="#FFEB61"
            />
            <path
              d="M102.187 40.2742C102.187 41.4133 102.756 41.9828 103.895 41.9828C104.286 41.9828 104.806 41.8852 105.457 41.6899V45.449C104.481 45.8395 103.374 46.0348 102.138 46.0348C99.7944 46.0348 98.2322 45.1235 97.4511 43.3009C94.9451 45.3188 91.9997 46.3277 88.615 46.3277C86.3368 46.3277 84.4003 45.7093 82.8055 44.4726C81.2108 43.2033 80.4134 41.4296 80.4134 39.1514C80.4134 36.4175 81.4386 34.4322 83.489 33.1955C85.5394 31.9262 87.9966 31.2916 90.8606 31.2916C92.7483 31.2916 94.7824 31.5194 96.9629 31.975V31.1451C96.9629 29.648 96.4259 28.4438 95.3519 27.5325C94.2779 26.6212 92.7645 26.1656 90.8118 26.1656C87.9152 26.1656 85.1 26.7677 82.3662 27.9719V23.1877C85.4255 22.1462 88.4197 21.6255 91.3488 21.6255C94.7661 21.6255 97.4186 22.4717 99.3062 24.164C101.226 25.8564 102.187 28.4275 102.187 31.8774V40.2742ZM91.8858 34.953C90.1609 34.953 88.7126 35.2621 87.5409 35.8805C86.3693 36.4989 85.7835 37.4752 85.7835 38.8096C85.7835 39.9162 86.2066 40.7786 87.0528 41.397C87.8989 41.9828 88.9404 42.2757 90.1772 42.2757C92.8459 42.2757 95.1078 41.3482 96.9629 39.4931V35.5388C95.0753 35.1482 93.3829 34.953 91.8858 34.953Z"
              fill="#FFEB61"
            />
            <path
              d="M110.275 26.1168C111.186 24.6522 112.537 23.5131 114.327 22.6995C116.117 21.8858 118.053 21.5767 120.136 21.7719V26.8979C118.053 26.605 116.166 26.8816 114.473 27.7278C112.781 28.574 111.577 29.827 110.861 31.4868V45.693H105.637V22.2601H110.275V26.1168Z"
              fill="#FFEB61"
            />
            <path
              d="M138.692 11.52H143.915V45.693H139.229V41.9828C136.951 44.8794 133.956 46.3277 130.246 46.3277C126.796 46.3277 123.997 45.1398 121.849 42.7639C119.701 40.3555 118.627 37.4264 118.627 33.9766C118.627 30.5267 119.701 27.6139 121.849 25.238C123.997 22.8297 126.796 21.6255 130.246 21.6255C133.761 21.6255 136.576 22.8459 138.692 25.2869V11.52ZM138.643 31.0963C138.025 29.7294 137.048 28.574 135.714 27.6302C134.412 26.6863 132.899 26.2144 131.174 26.2144C129.058 26.2144 127.317 26.9467 125.95 28.4113C124.583 29.8433 123.9 31.6984 123.9 33.9766C123.9 36.2548 124.583 38.1262 125.95 39.5907C127.317 41.0227 129.058 41.7387 131.174 41.7387C132.899 41.7387 134.412 41.2668 135.714 40.323C137.048 39.3792 138.025 38.2075 138.643 36.8081V31.0963Z"
              fill="#FFEB61"
            />
            <path
              d="M145.817 28.6065C145.817 26.2307 146.712 24.4732 148.502 23.3341C150.324 22.195 152.537 21.6255 155.141 21.6255C158.168 21.6255 160.983 22.2927 163.587 23.627V28.216C162.61 27.5651 161.357 27.0281 159.828 26.605C158.298 26.1493 156.85 25.9215 155.483 25.9215C154.279 25.9215 153.253 26.1331 152.407 26.5562C151.561 26.9467 151.138 27.5813 151.138 28.4601C151.138 29.2737 151.626 29.9572 152.602 30.5105C153.579 31.0312 154.75 31.4868 156.117 31.8774C157.517 32.2354 158.9 32.6748 160.267 33.1955C161.634 33.6837 162.806 34.4485 163.782 35.49C164.758 36.5314 165.246 37.8495 165.246 39.4443C165.246 41.8526 164.303 43.6101 162.415 44.7167C160.527 45.7907 158.103 46.3277 155.141 46.3277C151.463 46.3277 148.404 45.5791 145.963 44.082V39.4443C148.469 41.1041 151.447 41.934 154.897 41.934C158.282 41.934 159.974 41.1366 159.974 39.5419C159.974 38.7608 159.486 38.1099 158.51 37.5892C157.533 37.0359 156.345 36.5802 154.946 36.2222C153.579 35.8317 152.196 35.3923 150.796 34.9041C149.429 34.3834 148.258 33.6023 147.281 32.5608C146.305 31.4868 145.817 30.1687 145.817 28.6065Z"
              fill="#FFEB61"
            />
          </svg>
        </router-link>
        <nav>
          <ul>
            <li>
              <router-link to="/horoscope/zodiac"
                >Зодикальный гороскоп</router-link
              >
            </li>
            <li>
              <router-link to="/horoscope/chinese"
                >Китайский гороскоп</router-link
              >
            </li>
            <li>
              <router-link to="/horoscope/japanese"
                >Японский гороскоп</router-link
              >
            </li>
            <li>
              <router-link to="/horoscope/zoroastrian"
                >Зороастрийский гороскоп</router-link
              >
            </li>
            <li>
              <router-link to="/horoscope/floral"
                >Цветочный гороскоп</router-link
              >
            </li>
            <li>
              <router-link to="/horoscope/maya">Гороскоп Майя</router-link>
            </li>
            <li>
              <router-link to="/horoscope/druids">Гороскоп Друидов</router-link>
            </li>
            <li><router-link to="/404">О проекте</router-link></li>
            <li><router-link to="/404">Карта сайта</router-link></li>
            <li><router-link to="/404">Контактная политика</router-link></li>
            <li>
              <router-link to="/404">Пользовательское соглашение</router-link>
            </li>
          </ul>
        </nav>
      </footer>
    </div>
  </section>
</template>

<style scoped>
.footer {
  margin-bottom: 0;
}
p {
  font-weight: 400;
  font-size: 13px;
  line-height: 154%;
  color: var(--dark-main-60);
  padding: 0 48px;
  margin-bottom: 48px;
}
footer {
  padding: 28px 48px;
  display: flex;
  flex-direction: column;
  gap: 32px;
}
ul {
  display: flex;
  flex-wrap: wrap;
  column-gap: 20px;
  row-gap: 16px;
}
li {
  a {
    font-weight: 500;
    font-size: 15px;
    line-height: 160%;
    color: var(--dark-select-40);
  }
}
@media (max-width: 700px) {
  p {
    font-weight: 400;
    font-size: 11px;
    line-height: 182%;
    margin-bottom: 0;
    padding: 0;
  }
  footer {
    padding: 28px 48px;
    display: flex;
    flex-direction: column;
    gap: 32px;
    padding: 28px 0;
  }
  ul {
    display: flex;
    flex-direction: column;
    gap: 16px;
  }
}
</style>
