<script setup></script>

<template>
  <section>
    <div class="container">
      <div class="text_wrapper">
        <h1>Темперамент и характер</h1>
        <p>
          Овен - первый знак зодиака и олицетворение огня, что делает его
          энергичным, страстным и решительным. Люди, рожденные под знаком Овна,
          обычно обладают сильным характером, они полны энтузиазма и стремления
          к новым начинаниям. Они часто бывают импульсивными и бесстрашными,
          готовыми взять на себя риск, чтобы достичь своих целей. Овны обычно
          очень активны и энергичны, они любят действовать и идти вперед. У них
          часто бывает сильное чувство собственного достоинства и независимости.
          В то же время, Овны могут быть несколько самоуверенными и не терпят
          ограничений. Им свойственно проявление лидерских качеств, но иногда им
          может не хватать терпения и настойчивости для достижения долгосрочных
          целей
        </p>
      </div>
      <div class="text_wrapper">
        <h1>Профессии</h1>
        <p>
          Энергия, страсть и решительность делают Овнов идеальными кандидатами
          для руководящих и управленческих позиций, где они могут проявить свои
          лидерские качества и принять на себя ответственность за принятие
          решений. Благодаря своей способности к физической активности и
          стремлению к новым вызовам, Овны могут выделяться в роли спортсменов,
          тренеров или фитнес-инструкторов, где они могут использовать свою
          энергию и страсть к движению. Также Овны могут быть привлечены к
          профессиям, связанным с приключениями и экстремальными видами
          деятельности. Их импульсивный характер и стремление к новым ощущениям
          делают их подходящими для таких сфер, как путешествия, альпинизм,
          экстремальный туризм и т. д.Наконец, Овны могут проявить себя в
          медицинских и спасательных профессиях, где требуется быстрая реакция,
          стрессоустойчивость и высокий уровень энергии. Они могут быть
          успешными в роли врачей, медицинских сестер или спасателей, где их
          энергия и решительность могут быть использованы для помощи другим.
        </p>
      </div>
      <div class="text_wrapper">
        <h1>Любовь</h1>
        <p>
          В любви и личной жизни Овны обычно проявляют себя как страстные и
          преданные партнеры. Они стремятся к лидерству и контролю в отношениях,
          но также ценят равноправие и независимость. Овны вкладывают много
          энергии и страсти в свои отношения, предпочитая интенсивные и
          страстные взаимоотношения, но они также нуждаются в свободе и
          независимости. В отношениях они часто проявляют инициативу, стремясь к
          равноправным отношениям, где обе стороны могут высказывать свое мнение
          и принимать решения.
        </p>
      </div>
    </div>
  </section>
</template>

<style scoped>
.container {
  display: flex;
  justify-content: center;
  flex-direction: column;
  gap: 64px;
}
.text_wrapper {
  display: flex;
  flex-direction: column;
  gap: 32px;
  max-width: 720px;
  margin: 0 auto;

  h1 {
    font-weight: 900;
    font-size: 40px;
    line-height: 110%;
    color: var(--dark-select-10);
  }
  p {
    font-weight: 400;
    font-size: 19px;
    line-height: 147%;
    color: var(--dark-select-20);
  }
}
@media (max-width: 1100px) {
  .container {
    justify-content: start;
    flex-direction: column;
    gap: 20px;
  }
  .text_wrapper {
    gap: 16px;

    h1 {
      font-size: 24px;
      line-height: 117%;
    }
    p {
      font-size: 15px;
      line-height: 160%;
    }
  }
}
</style>
