
export const mayaSigns = [
    { ru: 'Красный Дракон', en: 'red_dragon', description: 'Этот знак символизирует рождение нового и защиту жизни. Дракон помогает воплотить свои мечты в реальность и защищает от опасностей.' },
    { ru: 'Белый Ветер', en: 'white_wind', description: 'Символ дыхания жизни, свежести и вдохновения. Ветер приносит изменения и новые возможности, оживляя среду.' },
    { ru: 'Синяя Ночь', en: 'blue_night', description: 'Символ глубокого понимания и интуиции. Ночь приглашает к погружению в своё внутреннее "я" и исследованию своих сновидений.' },
    { ru: 'Жёлтое Семя', en: 'yellow_seed', description: 'Этот знак символизирует рождение, рост и развитие. Семя помогает сеять и ухаживать за собственным потенциалом.' },
    { ru: 'Красный Змей', en: 'red_snake', description: 'Символ жизненной энергии, преобразования и перемен. Змей помогает преодолеть страхи и обрести новое начало.' },
    { ru: 'Белый Соединитель Миров', en: 'white_world_bridger', description: 'Этот знак символизирует путешествие между мирами и процесс трансформации. Он помогает преодолевать границы и связывать различные аспекты жизни.' },
    { ru: 'Синяя Рука', en: 'blue_hand', description: 'Символ связи и взаимодействия. Рука помогает установить контакт с другими и реализовать свои намерения.' },
    { ru: 'Жёлтая Звезда', en: 'yellow_star', description: 'Символ красоты, гармонии и эстетики. Звезда вдохновляет на творчество и помогает обрести внутренний свет.' },
    { ru: 'Красная Луна', en: 'red_moon', description: 'Символ интуиции, магии и внутреннего знания. Луна приглашает к исследованию своих глубин и развитию интуитивных способностей.' },
    { ru: 'Белая Собака', en: 'white_dog', description: 'Символ чистоты, верности и преданности. Этот знак обычно ассоциируется с домашними животными и покровительствует семейным ценностям.' },
    { ru: 'Синяя Обезьяна', en: 'blue_monkey', description: 'Этот знак символизирует радость, игру и творчество. Обезьяна помогает привносить лёгкость и веселье в жизнь.' },
    { ru: 'Жёлтый Человек', en: 'yellow_human', description: 'Символ общности, понимания и сотрудничества. Человек помогает создавать гармоничные отношения и строить сообщества.' },
    { ru: 'Красный небесный странник', en: 'red_skywalker', description: 'Этот знак символизирует свободу, приключения и духовное путешествие. Странник помогает открыть новые горизонты и расширить свой мир.' },
    { ru: 'Белый Волшебник', en: 'white_wizard', description: 'Символ мудрости, исцеления и магии. Волшебник является посредником между миром духов и миром людей.' },
    { ru: 'Синий Орёл', en: 'blue_eagle', description: 'Символ высокого полёта и ясного обзора. Орел помогает обрести новые перспективы и понять своё место во вселенной.' },
    { ru: 'Жёлтый Воин', en: 'yellow_warrior', description: 'Символ силы, защиты и мужества. Воин помогает преодолевать препятствия и смело следовать к своим целям.' },
    { ru: 'Красная Земля', en: 'red_earth', description: 'Символ материнства, плодородия и соединения с землёй. Земля призывает к уважению природы и ответственному обращению с ресурсами.' },
    { ru: 'Белое Зеркало', en: 'white_mirror', description: 'Этот знак отражает прошлое, настоящее и будущее. Зеркало помогает видеть и осознавать свои ошибки и достижения.' },
    { ru: 'Синяя Буря', en: 'blue_storm', description: 'Этот знак символизирует перемену, очищение и обновление. Буря помогает расчистить путь для новых возможностей и преобразований.' },
    { ru: 'Жёлтое Солнце', en: 'yellow_sun', description: 'Символ жизни, энергии и освещения. Солнце приносит тепло и свет, позволяя расцвести своему внутреннему блеску.' }
];