<script setup></script>

<template>
  <section class="footer">
    <p>
      Цвета, как язык дизайна, могут творить чудеса на экране. От пастельных
      оттенков, приносящих умиротворение, до ярких, взрывных цветов, создающих
      динамичные визуальные впечатления. Интерфейс — это путеводная звезда
      пользователя в мире технологий. Правильное сочетание цветов не только
      привлекает внимание, но и улучшает восприятие информации. Так что давайте
      играть с палитрой, создавая уникальные визуальные истории, которые не
      оставят равнодушными тех, кто взаимодействует с интерфейсом. Готов
      воплощать цветовые идеи в жизнь!"Цвета, как язык дизайна, могут творить
      чудеса на экране. От пастельных оттенков, приносящих умиротворение, до
      ярких, взрывных цветов, создающих динамичные визуальные впечатления.
      Интерфейс — это путеводная звезда пользователя в мире технологий.
      Правильное сочетание цветов не только привлекает внимание, но и улучшает
      восприятие информации. Так что давайте играть с палитрой, создавая
      уникальные визуальные истории, которые не оставят равнодушными тех, кто
      взаимодействует с интерфейсом. Готов воплощать цветовые идеи в
      жизнь!"Цвета, как язык дизайна, могут творить чудеса на экране. От
      пастельных оттенков, приносящих умиротворение, до ярких, взрывных цветов,
      создающих динамичные визуальные впечатления. Интерфейс — это путеводная
      звезда пользователя в мире технологий. Правильное сочетание цветов не
      только привлекает внимание, но и улучшает восприятие информации. Так что
      давайте играть с палитрой, создавая уникальные визуальные истории, которые
      не оставят равнодушными тех, кто взаимодействует с интерфейсом. Готов
      воплощать цветовые идеи в жизнь!"Цвета, как язык дизайна, могут творить
      чудеса на экране. От пастельных оттенков, приносящих умиротворение, до
      ярких, взрывных цветов, создающих динамичные визуальные впечатления.
      Интерфейс — это путеводная звезда пользователя в мире технологий.
      Правильное сочетание цветов не только привлекает внимание, но и улучшает
      восприятие информации. Так что давайте играть с палитрой, создавая
      уникальные визуальные истории, которые не оставят равнодушными тех, кто
      взаимодействует с интерфейсом. Готов воплощать цветовые идеи в жизнь!"
    </p>
    <footer>
      <nav>
        <ul>
          <li>Зодикальный гороскоп</li>
          <li>Китайский гороскоп</li>
          <li>Японский гороскоп</li>
          <li>Зороастрийский гороскоп</li>
          <li>Цветочный гороскоп</li>
          <li>Гороскоп Майя</li>
          <li>Гороскоп друидов</li>
          <li>О проекте</li>
        </ul>
      </nav>
    </footer>
  </section>
</template>

<style scoped>
section {
  padding: 0 48px;
}
p {
  font-weight: 400;
  font-size: 11px;
  line-height: 118%;
  color: #707070;
  margin-bottom: 172px;
}
footer {
  margin-bottom: 28px;
}
ul {
  display: flex;
  flex-wrap: wrap;
  gap: 16px;
}
li {
  font-weight: 500;
  font-size: 15px;
  line-height: 160%;
  color: #a4a5a5;
  cursor: pointer;
}
li:hover {
  opacity: 70%;
}
</style>
